isekaijob_work/app/views/girudo_questions/index.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."girudo_question_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["girudo_question_id", 1], ["LIMIT", 1]]
---
  <% @girudo_questions.each do |girudo_question| %>
    <% first_question_id = girudo_question.questions.order(:id).first.id %>