isekaijob_work/app/controllers/girudo_questions_controller.rb

SELECT "girudo_questions".* FROM "girudo_questions"
SELECT "questions".* FROM "questions" WHERE "questions"."girudo_question_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["girudo_question_id", 1], ["LIMIT", 1]]
---
  def index
    @girudo_questions = GirudoQuestion.all

SELECT "girudo_questions".* FROM "girudo_questions" WHERE "girudo_questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @girudo_question = GirudoQuestion.find(params[:id])