isekaijob_work/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "girudo_questions".* FROM "girudo_questions" WHERE "girudo_questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."girudo_question_id" = $1 AND (id > 1) ORDER BY "questions"."id" ASC LIMIT $2  [["girudo_question_id", 1], ["LIMIT", 1]]
---
  def show
    @question = Question.find(params[:id])
    @next_question = Question.where(girudo_question_id: @question.girudo_question_id)
                             .where('id > ?', @question.id).first