isekaijob_work/app/controllers/questions_controller.rb

SELECT "choices".* FROM "choices"
---
  def show
    # 質問の最初で明示的に空にする
    if params[:id] == "1" || params[:id] == "11" || params[:id] == "21" || params[:id] == "31"
      session[:answers] = nil
    end

    # (nilなら)セッションでユーザーの選択を追跡
    session[:answers] ||= {}
    # (nilなら)初期化
    session[:answers]['YES'] ||= 0

    # 今回の質問内容取得
    @question = Question.find(params[:id])

    # セッションを使用してユーザーの選択を記録する
    session[:answers][@question.id] = params[:choice] if params[:choice]

    # 加算判定(YESの場合のみ)
    if params[:choice] == 'YES'
      session[:answers]['YES'] += 1
    end
    # puts session[:answers].values.count('YES')

    # 各ギルドの最後の質問IDを取得
    last_question_ids = GirudoQuestion.pluck(:id).map do |girudo_id|
      Question.where(girudo_question_id: girudo_id).order(id: :desc).first.id
    end
    # puts last_question_ids

    # 現在の質問が最後の質問であるか確認
    if last_question_ids.include?(@question.id)