isekaijob_work/app/controllers/results_controller.rb

  def index
    yes_count = UserChoice.joins(:choice).where(choices: { score: 1 }).count
    no_count = UserChoice.joins(:choice).where(choices: { score: 0 }).count

    # もしyes_count または no_count が nil であれば、0 として扱います
    yes_count ||= 0
    no_count ||= 0

    # YESのカウントがNOのカウントより多い場合は 'A'、そうでない場合は 'B' とする
    result_text = yes_count > no_count ? 'A' : 'B'
    # Result レコードを取得または初期化する
    # ここでは find_or_initialize_by メソッドを使用して、もしレコードが見つからない場合は新しいインスタンスを作成します
    @result = Result.find_or_initialize_by(result_text: result_text)
    @result.count = [yes_count, no_count].max
---
SELECT COUNT(*) FROM "user_choices" INNER JOIN "choices" ON "choices"."id" = "user_choices"."choice_id" WHERE "choices"."score" = $1  [["score", 1]]
SELECT COUNT(*) FROM "user_choices" INNER JOIN "choices" ON "choices"."id" = "user_choices"."choice_id" WHERE "choices"."score" = $1  [["score", 0]]
SELECT "results".* FROM "results" WHERE "results"."result_text" = $1 LIMIT $2  [["result_text", "B"], ["LIMIT", 1]]
SELECT "results".* FROM "results" ORDER BY "results"."created_at" DESC LIMIT $1  [["LIMIT", 1]]