isekaijob_work/app/models/result.rb

  def self.update_result
    yes_points = Choice.where(choice_text: 'YES').count
    no_points = Choice.where(choice_text: 'NO').count
---
SELECT COUNT(*) FROM "choices" WHERE "choices"."choice_text" = $1  [["choice_text", "YES"]]
SELECT COUNT(*) FROM "choices" WHERE "choices"."choice_text" = $1  [["choice_text", "NO"]]