isekaijob_work/app/views/results/index.html.erb

SELECT "results".* FROM "results" WHERE "results"."result_text" = $1 LIMIT $2  [["result_text", "B"], ["LIMIT", 1]]
---

<p>あなたの結果は<%= @result.result_text %>です。合計ポイント: <%= @result.count %></p>